Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Use caution when changing to a date in the future as it may cause scheduled tasks to run prematurely!
ja: 未来の日付に変更すると、スケジュールされたタスクが早期に実行される可能性があるため、注意が必要です！

source: Use decimal (not hexadecimal) numbers for the X and Y options.
ja: Xと Yのオプションには、10進数（16進数ではない）を使用します。

source: Use either a downloaded setup.exe or files extracted from a downloaded zip or other source.
ja: ダウンロードしたsetup.exeか、ダウンロードしたzipなどから展開したファイルを使用する。

source: Use functions such as PixelSearch, PixelGetColor, and ImageSearch to automate game actions.
ja: PixelSearch、PixelGetColor、ImageSearchなどの関数を使用して、ゲームアクションを自動化することができます。

source: Use of the What parameter can allow a complex function to use helper functions to perform its work or parameter validation, while omitting those internal details from any reported error information.
ja: Whatパラメータを使用すると、複雑な関数がヘルパー関数を使用して作業やパラメータの検証を行い、報告されるエラー情報からはそれらの内部詳細を省くことができます。

source: Use only one space or tab between the final option and the filename itself; any other spaces and tabs are treated as part of the filename.
ja: 最後のオプションとファイル名の間には、スペースまたはタブを1つだけ使用します。その他のスペースやタブは、ファイル名の一部として扱われます。

source: Use the GuiControl object to operate upon individual controls in a GUI window.
ja: GUIウィンドウの各コントロールを操作するには、GuiControlオブジェクトを使用します。

source: Use the OnClipboardChange function which was added in v1.1.20 instead.
ja: 代わりにv1.1.20で追加されたOnClipboardChange関数を使用してください。

source: Use the Send function.
ja: 送信機能を使う。

source: Use the SendInput or SendPlay methods rather than the traditional SendEvent method.
ja: 従来のSendEventメソッドではなく、SendInputまたはSendPlayメソッドを使用します。

source: Use the script by polyethene (examples are included).
ja: polyetheneによるスクリプトを使用します（例文が含まれています）。

source: Use the tray menu or the ExitApp function to exit a script.
ja: スクリプトを終了するには、トレイメニューまたはExitApp関数を使用します。

source: Use the Format function to produce a numeric string in a different format.
ja: 数値文字列を別の形式で出力する場合は、Format関数を使用します。

source: Use the += operator instead of the + prefix.
ja: 接頭辞+の代わりに+=演算子を使用します。

source: Use the /silent switch to suppress warning or confirmation dialogs and prevent the Dash from being shown when installation is complete.
ja: /silentスイッチを使用すると、警告ダイアログや確認ダイアログが表示されず、インストール完了時にDashが表示されなくなります。

source: Use the UIAccess shell verb with Run, as in Run '*UIAccess "Your script.ahk"'.
ja: Run '*UIAccess "Your script.ahk"'のように、UIAccessシェル動詞をRunで使用します。

source: Use the T (timeout) option to automatically close the message box after a certain number of seconds.
ja: T（タイムアウト）オプションを使用すると、一定の秒数後にメッセージボックスを自動的に閉じます。

source: Use the debugger toolbar or shortcut keys to control the debugger.
ja: デバッガーのツールバーやショートカットキーを使って、デバッガーを操作することができます。

source: Use the following (added in v1.1.21) instead:
ja: 代わりに下記（v1.1.21で追加）を使用してください：

source: Use the following script to discover the available audio device and component names and whether each device or component supports volume and/or mute controls.
ja: 以下のスクリプトを使用して、使用可能なオーディオデバイスとコンポーネント名、および各デバイスまたはコンポーネントがボリュームおよび/またはミュートコントロールをサポートしているかどうかを検出します。

source: Use the keyboard hook
ja: キーボードフックを使用する

source: Use the large version of the icon.
ja: アイコンの大きいバージョンを使用してください。

source: Use the left key of the pair.
ja: ペアの左キーを使用します。

source: Use the letter A for WinTitle and omit the other three window parameters (WinText, ExcludeTitle and ExcludeText), to operate on the active window.
ja: WinTitleにはアルファベットAを使用し、他の3つのウィンドウ・パラメーター（WinText、ExcludeTitle、ExcludeText）を省略すると、アクティブなウィンドウに対して動作する。

source: Use the methods and properties of this object to access the file's contents.
ja: このオブジェクトのメソッドとプロパティを使用して、ファイルのコンテンツにアクセスします。

source: Use the names of the keys (Tab and Space) rather than their characters.
ja: キーの文字ではなく、キーの名前（Tab、Space）を使用します。

source: Use the return value to determine which button the user pressed in the message box.
ja: 戻り値から、ユーザーがメッセージボックスのどのボタンを押したかを判断します。

source: Use the right key of the pair.
ja: ペアのうち右側のキーを使用します。

source: Use this option to have the user's keystrokes sent to the active window.
ja: ユーザーのキー入力をアクティブウィンドウに送るには、このオプションを使用します。

source: Use this option to make auto-replace hotstrings case insensitive and prevent them from conforming to the case of the characters you actually type.
ja: このオプションを使用すると、自動置換ホットストリングの大文字と小文字を区別せず、実際に入力する文字の大文字と小文字を一致させないようにすることができます。

source: Use this option to make auto-replace hotstrings case-insensitive and prevent them from conforming to the case of the characters you actually type.
ja: このオプションを使用すると、自動置換ホットストリングの大文字と小文字を区別せず、実際に入力する文字の大文字と小文字を一致させないようにすることができます。

source: Use try/catch instead.
ja: 代わりにtry/catchを使用します。

source: Use what is known as a continuation section.
ja: 継続セクションと呼ばれるものを使用する。

source: Used to modify and display menus or menu bars.
ja: メニューやメニューバーを変更したり表示したりするときに使用します。

source: Used with the reference operator (e.g. &MyVar).
ja: 参照演算子（例えば、&MyVar）と共に使用します。

source: User Idle Time:
ja: ユーザーアイドル時間：

source: User Idle Time: A_TimeIdle, A_TimeIdlePhysical, A_TimeIdleKeyboard, A_TimeIdleMouse
ja: ユーザーアイドル時間：A_TimeIdle、A_TimeIdlePhysical、A_TimeIdleKeyboard、A_TimeIdleMouse

source: User bug reports (and simple logic) indicate that if it works, it allows the focus to be stolen by programs which aren't specifically designed to do so.
ja: ユーザーのバグ報告（と単純な論理）によると、もしそれが機能すれば、特に設計されていないプログラムによってフォーカスを盗まれることが可能になるそうです。

source: User-configurable shortcut keys - Settings, Shortcut Mapper..., Plugin commands.
ja: ユーザー設定可能なショートカットキー - 設定、ショートカットマッパー...、プラグインコマンド。

source: User-defined classes can also explicitly extend Object, Array, Map or some other built-in class (though doing so is not always useful), with Object being the default base class if none is specified.
ja: ユーザー定義クラスは、Object、Array、Mapなどの組み込みクラスを明示的に拡張することも可能です（ただし、拡張することが必ずしも有用とは限りません）。Object は、何も指定されていない場合のデフォルトの基底クラスです。

source: User-defined function objects must define a Call method containing the implementation of the "function".
ja: ユーザー定義関数オブジェクトは、「関数」の実装を含むCallメソッドを定義しなければならない。

source: User-defined functions may use the new keyword unset as a parameter default value to make the parameter "unset" when no value was provided.
ja: ユーザー定義関数は、新しいキーワードunsetをパラメータのデフォルト値として使用し、値が提供されていない場合にパラメータを「unset」にすることができます。

source: User-defined objects can utilize this by defining an __Item property.
ja: ユーザー定義オブジェクトは、__Itemプロパティを定義することでこれを利用することができます。

source: User-defined property setters may have returned unexpected values or failed to return anything.
ja: ユーザー定義のプロパティセッターが予期せぬ値を返したり、何も返せなかったりした可能性があります。

source: Uses a Buffer to receive a string from an external function via DllCall.
ja: Bufferを使って、DllCallで外部関数から文字列を受け取ります。

source: Uses a more elaborate method to retrieve the color, which may work in certain full-screen applications when the other methods fail.
ja: より精巧な方法で色を取得します。これは、特定のフルスクリーンアプリケーションで、他の方法が失敗した場合に機能する可能性があります。

source: Uses a simpler method to determine OutputVarControl.
ja: OutputVarControlを決定するために、より単純な方法を使用します。

source: Uses a transparent background, which allows any control that lies behind a Text, Picture, or GroupBox control to show through.
ja: 透明な背景を使用し、Text、Picture、GroupBox コントロールの後ろにあるコントロールが透けて見えるようにします。

source: Uses alternate submit method.
ja: 別の送信方法を使用します。

source: Uses an alternate method to retrieve the color, which should be used when the normal method produces invalid or inaccurate colors for a particular type of window.
ja: 色を取得するための代替方法を使用します。通常の方法では、特定のタイプのウィンドウに対して無効または不正確な色が生成される場合に使用します。

source: Uses lines to link items at the root of the tree-view control.
ja: ツリービューコントロールのルートでアイテムをリンクするためにラインを使用します。

source: Uses lines to show the hierarchy of items.
ja: 項目の階層を示すために線を使用します。

source: Using #Include to Share Functions Among Multiple Scripts
ja: 複数のスクリプト間で関数を共有するための#Includeの使い方

source: Using /restart ensures that a single instance prompt is not shown if the new instance of the script starts before ExitApp is called.
ja: /restartを使用すると、ExitAppが呼び出される前にスクリプトの新しいインスタンスが開始されても、単一インスタンスのプロンプトが表示されないようにします。

source: Using Critical to increase the message check interval gives the function more time to complete before any messages are dispatched.
ja: Criticalを使用してメッセージチェックの間隔を長くすると、メッセージが送信される前に機能が完了する時間が長くなります。

source: Using +Background without specifying a color reverts -Background.
ja: 色を指定せずに+Backgroundを使用すると、-Backgroundに戻ります。

source: Using ClipboardAll while cells from Microsoft Excel are on the clipboard may cause Excel to display a "no printers" dialog.
ja: Microsoft Excelのセルがクリップボードにある状態でClipboardAllを使用すると、Excelに「プリンターがありません」ダイアログが表示される場合があります。

source: Using GroupDeactivate a second time will activate the next window in the series and so on.
ja: 2回目にGroupDeactivateを使用すると、シリーズの次のウィンドウがアクティブになり、以下同様です。

source: Using HotIf puts context sensitivity into effect for all subsequently created hotkeys in the current thread, and affects which hotkey variants the Hotkey function modifies.
ja: HotIfを使用すると、現在のスレッドでその後に作成されるすべてのホットキーに対してコンテキストセンシティビティを有効にし、Hotkey関数が変更するホットキーバリアントに影響します。

source: Using Keyboard Numpad as a Mouse
ja: キーボードのテンキーパッドをマウスとして使う

source: Using Objects
ja: オブジェクトの使用

source: Using a Controller as a Mouse
ja: コントローラーをマウスとして使う

source: Using a controller as a mouse.
ja: コントローラーをマウスとして使う

source: Using a dash in between creates a range; for example, [a-z] means "any single character that is between lowercase a and z (inclusive)".
ja: 例えば、[a-z]は「小文字のaからzの間にある任意の1文字（含む）」を意味します。

source: Using a joystick as a mouse.
ja: ジョイスティックをマウスとして使用します。

source: Using any of these commands causes the previous value of A_LastError to be overwritten.
ja: これらのコマンドを使用すると、A_LastErrorの以前の値は上書きされます。

source: Using it a second time will activate the next window in the series and so on.
ja: 2回目に使用すると、シリーズの次のウィンドウが起動します。

source: Using non-ASCII characters safely in scripts.
ja: スクリプトで非ASCII文字を安全に使用する。

source: Using square brackets without a property name only invokes the __Item property.
ja: プロパティ名なしで角括弧を使用すると、__Itemプロパティのみが呼び出されます。

source: Using such fonts ensures that they are displayed on most operating systems.
ja: このようなフォントを使用すれば、ほとんどのオペレーティング・システムで確実に表示されます。

source: Using the Program
ja: プログラムの使用

source: Using the Program | AutoHotkey v2
ja: プログラムの使い方｜AutoHotkey v2

source: Using this registry value may be more future-proof.
ja: このレジストリ値を使用する方が、将来的により安全かもしれない。

source: Usually Message indicates the expected and actual type, and Extra contains a string representing the errant value.
ja: 通常、Messageは期待される型と実際の型を示し、Extraは誤った値を表す文字列を含みます。

source: Usually Message indicates which expectation was broken, and Extra contains a string representing the errant value.
ja: 通常、Messageはどの期待値が破られたかを示し、Extraは誤った値を表す文字列を含みます。

source: Usually a function accepts parameters which tell it how to operate or what to operate on.
ja: 通常、関数は、操作方法や操作対象を指示するパラメータを受け取ります。

source: Usually a unit wouldn't be deleted, but maybe the agent will have any junk you left behind removed; just as any values you stored in an object are freed when the object is deleted.
ja: 通常、ユニットは削除されませんが、もしかしたらエージェントは、あなたが残したガラクタを削除させるかもしれません。オブジェクトに保存した値が、オブジェクトを削除するときに解放されるのと同じです。

source: Usually equivalent to SoundSetMute -1.
ja: 通常、SoundSetMute -1と同等です。

source: Usually equivalent to SoundSetVolume "+5".
ja: 通常、SoundSetVolume "+5"と同等です。

source: Usually equivalent to SoundSetVolume -5.
ja: 通常、SoundSetVolume -5と同等です。

source: Usually in such cases the message "7-zip Error" is displayed.
ja: 通常このような場合、「7-zip Error」というメッセージが表示されます。

source: Usually, Windows CE sizes a combo box so that it does not display partial items.
ja: 通常、Windows CEでは、コンボボックスのサイズは、部分的な項目を表示しないように設定されています。

source: Usually, an expression takes one or more values as input, performs one or more operations, and produces a value as the result.
ja: 通常、式は1つ以上の値を入力とし、1つ以上の演算を行い、結果として値を生成します。

source: Usually, windows display text left-to-right (LTR).
ja: 通常、ウィンドウはテキストを左から右へ（LTR）表示する。

source: VS Code (plus extensions) provides an even higher level of support and a wider range of features, but can be heavy on resources.
ja: VS Code（および拡張機能）は、さらに高レベルのサポートと幅広い機能を提供するが、リソースが重くなる可能性がある。

source: VT_ARRAY and VT_BYREF are combined with another value (using bitwise OR)
ja: VT_ARRAYとVT_BYREFを別の値と結合する（ビット単位のOR使用）

source: VT_BOOL := 0xB ; Boolean True (-1) or False (0)
ja: VT_BOOL := 0xB ; 真(-1)または偽(0)の論理型。

source: VT_BSTR := 8 ; COM string (Unicode string with length prefix)
ja: VT_BSTR := 8 ; COM 文字列（Unicode 文字列に長さの接頭辞を付けたもの）。

source: VT_BYREF := 0x4000 ; Pointer to another type of value
ja: VT_BYREF := 0x4000 ; 別のタイプの値へのポインタ

source: VT_CY := 6 ; Currency
ja: VT_CY := 6 ; 通貨

source: VT_DATE := 7 ; Date
ja: VT_DATE := 7 ; 日付

source: VT_DECIMAL := 0xE ; (not supported)
ja: VT_DECIMAL := 0xE ; （サポートされていません）

source: VT_DISPATCH := 9 ; COM object
ja: VT_DISPATCH := 9 ; COM オブジェクト

source: VT_EMPTY := 0 ; No value
ja: VT_EMPTY := 0 ; 値なし

source: VT_EMPTY and VT_NULL are not valid base types for the array.
ja: VT_EMPTY と VT_NULL は、配列のベースタイプとして有効ではありません。

source: VT_ERROR := 0xA ; Error code (32-bit integer)
ja: VT_ERROR := 0xA ; エラーコード(32ビット整数)

source: VT_ERROR is no longer converted to Integer; it instead produces a ComValue.
ja: VT_ERRORはIntegerに変換されなくなり、代わりにComValueが生成されます。

source: VT_I1 := 0x10 ; 8-bit signed int
ja: VT_I1 := 0x10 ; 8ビット符号付き整数

source: VT_I2 := 2 ; 16-bit signed int
ja: VT_I2 := 2 ; 16ビット符号付き整数

source: VT_I4 := 3 ; 32-bit signed int
ja: VT_I4 := 3 ; 32ビット符号付き整数

source: VT_I8 := 0x14 ; 64-bit signed int
ja: VT_I8 := 0x14 ; 64ビット符号付き整数

source: VT_INT := 0x16 ; Signed machine int
ja: VT_INT := 0x16 ; 符号付きマシン整数

source: VT_R4 := 4 ; 32-bit floating-point number
ja: VT_R4 := 4 ; 32ビット浮動小数点数

source: VT_R8 := 5 ; 64-bit floating-point number
ja: VT_R8 := 5 ; 64ビット浮動小数点数

source: VT_RECORD := 0x24 ; User-defined type -- NOT SUPPORTED
ja: VT_RECORD := 0x24 ; ユーザー定義型 -- NOT SUPPORTED

source: VT_UI1 := 0x11 ; 8-bit unsigned int
ja: VT_UI1 := 0x11 ; 8ビット符号無し整数

source: VT_UI2 := 0x12 ; 16-bit unsigned int
ja: VT_UI2 := 0x12 ; 16ビット符号無し整数

source: VT_UI4 := 0x13 ; 32-bit unsigned int
ja: VT_UI4 := 0x13 ; 32ビット符号無し整数

source: VT_UI8 := 0x15 ; 64-bit unsigned int
ja: VT_UI8 := 0x15 ; 64ビット符号無し整数

source: VT_UINT := 0x17 ; Unsigned machine int
ja: VT_UINT := 0x17 ; 符号なしマシン整数

source: VT_UNKNOWN := 0xD ; IUnknown interface pointer
ja: VT_UNKNOWN := 0xD ; IUnknown インターフェースポインタ

source: VT_VARIANT := 0xC ; VARIANT (must be combined with VT_ARRAY or VT_BYREF)
ja: VT_VARIANT := 0xC ; VARIANT(VT_ARRAYまたはVT_BYREFとの組み合わせが必要)

source: Valid only with the s type.
ja: sタイプのみ有効です。

source: Value has been removed; use match.0 or match[] instead of match.Value(), and match[N] instead of match.Value(N).
ja: Valueは削除されました。match.Value()の代わりにmatch.0またはmatch[]を、match.Value(N)の代わりにmatch[N]を使ってください。

source: Value names displayed by Windows RegEdit as "(Default)" will be retrieved if a value has been assigned to them, but A_LoopRegName will be blank for them.
ja: Windows RegEditで「(既定)」と表示される値名は、値が割り当てられていれば取得できますが、A_LoopRegNameは空白になります。

source: Value properties simply contain a value.
ja: バリュープロパティは、単に値を含むだけである。

source: Value to set the environment variable to.
ja: 環境変数に設定する値。

source: Value.GetMethod(Name, ParamCount)
ja: Value.GetMethod(名前、ParamCount)

source: Value2} creates an Object with properties literally named Prop1 and Prop2.
ja: Value2} 文字通りProp1とProp2という名前のプロパティを持つObjectを作成します。

source: Values are addressed by their position within the array (known as an array index), where position 1 is the first element.
ja: 値は、配列内の位置（配列インデックス）で指定され、位置1が最初の要素になります。

source: Values are also included if both K and V are omitted.
ja: KとVの両方が省略された場合の値も含まれます。

source: Values for the Options parameter
ja: Optionsパラメータに設定する値

source: Values formerly returned via ErrorLevel are returned by other means, replaced with exceptions, superseded or simply not returned.
ja: 以前はErrorLevelで返されていた値は、他の手段で返されるか、例外で置き換えられるか、優先されるか、単に返されないかであります。

source: Values longer than 65,535 characters are likely to yield inconsistent results.
ja: 65,535文字より長い値は、一貫性のない結果になる可能性が高いです。

source: Values longer than 65,535 characters can be written to the file, but may produce inconsistent results as they usually cannot be read correctly by IniRead or other applications.
ja: 65,535文字より長い値は、ファイルに書き込むことができますが、通常IniReadや他のアプリケーションで正しく読み取ることができないため、一貫性のない結果をもたらす可能性があります。

source: Values of all kinds can be thrown, but if Catch is used without specifying a class (or Try is used without Catch or Finally), it will only catch instances of the Error class.
ja: あらゆる種類の値を投げることができるが、クラスを指定せずにCatchを使用した場合（またはCatchや Finallyを指定せずにTryを使用した場合）、Errorクラスのインスタンスのみをキャッチする。

source: Values to compare, as described in the remarks below.
ja: 以下の備考にあるように、比較する値。

source: Var := Add(2, 3) ; The number 5 will be stored in Var.
ja: Var := Add(2, 3) ; Varに数字5が格納されます。

source: Var2 := Var ; Assign a variable to another.
ja: Var2 := Var ; 変数に別の変数を代入します。

source: Var3 .= Var ; Append a variable to the end of another.
ja: Var3 .= Var ; 変数の末尾に別の変数を追記します。

source: Var4 += Num ; Add the value of a variable to another.
ja: Var4 += Num ; 変数に別の変数を加算します。

source: VarSetCapacity (use a Buffer object for binary data/structs and VarSetStrCapacity for UTF-16 strings)
ja: VarSetCapacity （バイナリデータ/構造体にはBufferオブジェクトを、UTF-16文字列にはVarSetStrCapacityを使用します）

source: VarSetStrCapacity - Syntax & Usage | AutoHotkey v2
ja: VarSetStrCapacity - 構文と使用法｜AutoHotkey v2

source: Variable Capacity and Memory
ja: 可変容量とメモリー

source: Variable References (VarRef)
ja: 変数参照（VarRef）

source: Variable and Function Names
ja: 変数名と関数名

source: Variable and function names do not allow [, ] or ?
ja: 変数名や関数名には、[、]や？

source: Variable assignment
ja: 変数の割り当て

source: Variable references in expr are resolved in the same way as in the equivalent full function definition.
ja: exprの変数参照は、同等の完全な関数定義と同じ方法で解決される。

source: Variables
ja: 変数

source: Variables accessed or created inside an assume-local function are local by default, with the following exceptions:
ja: assume-local関数の内部でアクセスまたは作成された変数は、以下の例外を除き、デフォルトでローカルとなります：

source: Variables and Expressions
ja: 変数と式

source: Variables and Expressions - Definition & Usage | AutoHotkey v2
ja: 変数と式 - 定義と使用法｜AutoHotkey v2

source: Variables and expressions
ja: 変数と式

source: Variables and their contents - See ListVars.
ja: 変数とその内容 -ListVarsを参照。

source: Variables can be assigned a few ways.
ja: 変数はいくつかの方法で割り当てることができる。

source: Variables can be omitted.
ja: 変数は省略可能です。

source: Variables cannot be created dynamically, but a variable can be assigned dynamically if it has been declared or referenced non-dynamically somewhere in the script.
ja: 変数は動的に作成できないが、スクリプトのどこかで非動的に宣言または参照されていれば、動的に代入できる。

source: Variables declared this way are now much less likely to conflict with local variables (such as when combining scripts manually or with #Include), as they are not super-global.
ja: このように宣言された変数は、スーパーグローバルではないため、ローカル変数と衝突する可能性が非常に低くなりました（手動でスクリプトを組み合わせる場合や#Includeを使用する場合などです）。

source: Variables in functions are local to that function by default, except in the following cases:
ja: 関数内の変数は、以下の場合を除き、デフォルトでその関数のローカル変数となります：

source: Variables which returned On/Off now return 1/0, which are more useful in expressions.
ja: On/Offを返していた変数が1/0を返すようになり、式でより便利になりました。

source: Variadic Function Calls
ja: 可変型関数の呼び出し

source: Variadic Functions
ja: 可変型関数

source: Variadic built-in functions now have a MaxParams value equal to MinParams, rather than an arbitrary number (such as 255 or 10000).
ja: 可変長引数組込関数のMaxParamsの値が、任意の数値（255 や 10000 など）ではなく、MinParamsと同じになるようになりました。

source: Variadic function calls previously had half-baked support for named parameters.
ja: 変数型関数呼び出しは、以前は名前付きパラメータを中途半端にサポートしていました。

source: Variadic functions receive an Array of parameters, and Arrays are also created by several built-in functions.
ja: 変数型関数は、パラメータの配列を受け取ります。また、配列はいくつかの組み込み関数でも作成されます。

source: Variant (Duplicate) Hotkeys
ja: バリアント（複製）ホットキー

source: Variant (Duplicate) Hotstrings
ja: バリアント（複製）ホットストリング

source: Variant Type
ja: バリアント型

source: Variant Type Constants
ja: バリアント型定数

source: Variations:
ja: バリエーション：

source: Various built-in functions have a WinTitle parameter, used to identify which window (or windows) to operate on.
ja: 様々な組み込み関数にはWinTitleパラメータがあり、どのウィンドウ（または複数のウィンドウ）を操作するかを識別するために使用されます。

source: Various string functions now have a CaseSense parameter which can be used to specify case-sensitivity or the locale mode.
ja: 様々な文字列関数にCaseSenseパラメータが追加され、大文字小文字の区別やロケールモードを指定することができるようになりました。

source: VerCompare - Syntax & Usage | AutoHotkey v2
ja: VerCompare - 構文と使用法｜AutoHotkey v2

source: Version 2, June 1991
ja: バージョン2、1991年6月

source: Version strings are compared according to the same rules as #Requires.
ja: バージョン文字列は、#Requiresと同じルールに従って比較される。

source: Version strings are compared as a series of dot-delimited components, optionally followed by a hyphen and pre-release identifier(s).
ja: バージョン文字列は、ドットで区切られた一連のコンポーネントとして比較され、オプションでハイフンとプレリリース識別子が続く。

source: Vertically centers text in the control's available height.
ja: コントロールの使用可能な高さでテキストを垂直方向にセンタリングする。

source: Very large
ja: とても大きい

source: Very small
ja: とても小さい

source: Via the "Help files (F1)" option in the Dash, which can be activated with the mouse or by pressing F1 while the Dash is active.
ja: Dashの「Help files (F1)」オプションで、マウスを使うか、Dashがアクティブな状態でF1を押すことで起動できます。

source: Via the "Help" menu in the main window of a running script, or by pressing F1 while the main window is active.
ja: 実行中のスクリプトのメインウィンドウにある「Help」メニューから、またはメインウィンドウがアクティブな状態でF1を押す。

source: Via the "Help" menu option in tray menu of a running script.
ja: 実行中のスクリプトのトレイメニューにある「ヘルプ」メニューオプションから。

source: View local/global variables.
ja: ローカル/グローバル変数を表示します。

source: View structure of objects.
ja: オブジェクトの構造を表示します。

source: View the call stack.
ja: コールスタックを表示します。

source: View the stack of running threads and functions.
ja: 実行中のスレッドと関数のスタックを表示する。

source: Views Haystack as a collection of individual lines (if it contains newlines) rather than as a single continuous line.
ja: ヘイスタックを連続した1行としてではなく、（改行が含まれている場合は）個々の行の集まりとして表示する。

source: Visible (default)
ja: 表示（初期値）

source: Visit Hotkeys and Hotstrings for additional hotkey and hotstring modifiers, information and examples.
ja: その他のホットキーとホットストリングの修飾子、情報、例については、ホットキーとホットストリングをご覧ください。

source: Visits all windows on the entire system and displays info about each of them.
ja: システム全体のすべてのウィンドウを訪問し、それぞれのウィンドウに関する情報を表示する。

source: Visual Studio Code can be configured with a high level of support for AutoHotkey by installing extensions.
ja: Visual Studio Codeは、拡張機能をインストールすることで、AutoHotkeyを高度にサポートするように設定できます。

source: Volume On-Screen-Display (OSD)
ja: 音量オンスクリーンディスプレイ（OSD）

source: Volume and mute controls are supported directly through SoundGetVolume, SoundSetVolume, SoundGetMute and SoundSetMute.
ja: ボリュームとミュートのコントロールは、SoundGetVolume、SoundSetVolume、SoundGetMute、SoundSetMuteを通じて直接サポートされます。

source: WB := MyGui.Add("ActiveX", "w980 h640", "Shell.Explorer").Value ; The last parameter is the name of the ActiveX component.
ja: WB := MyGui.Add("ActiveX", "w980 h640", "Shell.Explorer").Value ; 最後のパラメータは、ActiveXコンポーネントの名前です。

source: WB.Navigate("https://www.autohotkey.com/docs/") ; This is specific to the web browser control.
ja: WB.Navigate("https://www.autohotkey.com/docs/") ; これはウェブブラウザコントロールに特有のものです。

source: WPARAM and LPARAM are unsigned 32-bit integers (from 0 to 232-1) or signed 64-bit integers (from -263 to 263-1) depending on whether the exe running the script is 32-bit or 64-bit.
ja: WPARAMとLPARAMは、スクリプトを実行するexeが32ビットか64ビットかに応じて、符号なし32ビット整数（0から232-1）または符号付き64ビット整数（-263から263-1）です。

source: Wait for Notepad to appear on the screen
ja: メモ帳が画面に表示されるのを待つ

source: Wait for the key to be pushed down.
ja: キーが押し下げられるのを待ちます。

source: Waiting for another window to be created with the same HWND value would not be meaningful, as there would likely be no relation between the two windows.
ja: 同じHWND値で別のウィンドウが作成されるのを待っても、2つのウィンドウの間には何の関係もない可能性が高いので、意味がない。
